# SkylightWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..SkylightWidth Property
EnergyDataSettings Class See Also
---
Used for the conceptual energy model. The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double SkylightWidth { get; set; }
```

Visual Basic
---
```text
Public Property SkylightWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SkylightWidth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The skylight width is less than eight inches. |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace